open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_display_pack.c
/****************************************************************************
 * app/bk7258/bk7258_display_pack.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Strict, bounded and host-testable shaniu-eye-pack-v1 reader.
 ****************************************************************************/

#include "bk7258_display_pack.h"

#include <errno.h>
#include <fcntl.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/stat.h>
#include <unistd.h>

#ifdef __NuttX__
#  include <syslog.h>
#  define BKDISPLAY_PACK_DIAG(...) syslog(LOG_INFO, __VA_ARGS__)
#else
#  define BKDISPLAY_PACK_DIAG(...) do { } while (0)
#endif

#define BKDISPLAY_HEADER_SIZE          128u
#define BKDISPLAY_ENTRY_SIZE            64u
#define BKDISPLAY_MAX_ENTRIES           64u
#define BKDISPLAY_IO_BYTES            1024u
#define BKDISPLAY_PACK_VERSION           1u
#define BKDISPLAY_RENDERER_API           1u
#define BKDISPLAY_KIND_PALETTE           1u
#define BKDISPLAY_KIND_INDEXED_FRAME     2u
#define BKDISPLAY_CODEC_RAW              0u
#define BKDISPLAY_CODEC_RLE8             1u
#define BKDISPLAY_PIXEL_RGB565LE         1u
#define BKDISPLAY_PIXEL_INDEX8           2u
#define BKDISPLAY_ENTRY_MIRROR_RIGHT     1u

struct bkdisplay_entry_s
{
  char name[32];
  uint8_t kind;
  uint8_t codec;
  uint8_t pixel_format;
  uint8_t side;
  uint16_t flags;
  uint16_t width;
  uint16_t height;
  uint16_t palette_count;
  uint32_t offset;
  uint32_t stored_size;
  uint32_t decoded_size;
  uint32_t crc32;
};

struct bkdisplay_pack_s
{
  int fd;
  struct bkdisplay_pack_info_s info;
  uint16_t palette[256];
  struct bkdisplay_entry_s entries[BKDISPLAY_MAX_ENTRIES];
};

struct bkdisplay_expression_s
{
  char id[BKDISPLAY_EXPRESSION_SIZE];
  uint8_t sides;
};

static int bkdisplay_errno(void)
{
  return errno > 0 ? -errno : -EIO;
}

static uint16_t bkdisplay_le16(const uint8_t *data)
{
  return (uint16_t)data[0] | ((uint16_t)data[1] << 8);
}

static uint32_t bkdisplay_le32(const uint8_t *data)
{
  return (uint32_t)data[0] | ((uint32_t)data[1] << 8) |
         ((uint32_t)data[2] << 16) | ((uint32_t)data[3] << 24);
}

static uint32_t bkdisplay_crc32_update(uint32_t state,
                                       const uint8_t *data, size_t size)
{
  size_t index;

  for (index = 0; index < size; index++)
    {
      unsigned int bit;

      state ^= data[index];
      for (bit = 0; bit < 8; bit++)
        {
          state = (state >> 1) ^
                  (0xedb88320u & (uint32_t)-(int32_t)(state & 1u));
        }
    }

  return state;
}

static int bkdisplay_read_exact(int fd, void *buffer, size_t size)
{
  uint8_t *cursor = buffer;
  size_t done = 0;

  while (done < size)
    {
      ssize_t nread = read(fd, cursor + done, size - done);

      if (nread < 0)
        {
          if (errno == EINTR)
            {
              continue;
            }

          return bkdisplay_errno();
        }

      if (nread == 0)
        {
          return -ENODATA;
        }

      done += (size_t)nread;
    }

  return 0;
}

static int bkdisplay_seek(int fd, uint32_t offset)
{
  return lseek(fd, (off_t)offset, SEEK_SET) == (off_t)offset ? 0 :
         bkdisplay_errno();
}

static uint32_t bkdisplay_align4(uint32_t value)
{
  return (value + 3u) & ~3u;
}

static bool bkdisplay_pack_id_char(unsigned char byte, bool first)
{
  if (byte >= 'a' && byte <= 'z')
    {
      return true;
    }

  if (byte >= '0' && byte <= '9')
    {
      return true;
    }

  return !first && (byte == '.' || byte == '_' || byte == '-');
}

static bool bkdisplay_entry_char(unsigned char byte, bool first)
{
  if (byte >= 'a' && byte <= 'z')
    {
      return true;
    }

  if (!first && byte >= '0' && byte <= '9')
    {
      return true;
    }

  return !first && (byte == '_' || byte == '.' || byte == '/' ||
                    byte == '-');
}

static int bkdisplay_padded_ascii(const uint8_t *source, size_t size,
                                  char *target, size_t capacity,
                                  bool pack_id)
{
  size_t length = 0;
  size_t index;

  while (length < size && source[length] != 0)
    {
      bool valid = pack_id ?
        bkdisplay_pack_id_char(source[length], length == 0) :
        bkdisplay_entry_char(source[length], length == 0);

      if (!valid)
        {
          return -EPROTO;
        }

      length++;
    }

  if (length == 0 || length == size || length + 1 > capacity)
    {
      return -EPROTO;
    }

  for (index = length + 1; index < size; index++)
    {
      if (source[index] != 0)
        {
          return -EPROTO;
        }
    }

  memcpy(target, source, length);
  target[length] = '\0';
  return 0;
}

static bool bkdisplay_expression_id(const char *id)
{
  size_t length = 0;

  if (id == NULL || id[0] < 'a' || id[0] > 'z')
    {
      return false;
    }

  while (id[length] != '\0')
    {
      unsigned char byte = (unsigned char)id[length];

      if (!((byte >= 'a' && byte <= 'z') ||
            (length > 0 && byte >= '0' && byte <= '9') ||
            (length > 0 && (byte == '_' || byte == '-'))))
        {
          return false;
        }

      length++;
      if (length >= BKDISPLAY_EXPRESSION_SIZE)
        {
          return false;
        }
    }

  return length > 0;
}

static int bkdisplay_crc_region(int fd, uint32_t offset, uint32_t size,
                                uint32_t *result)
{
  uint8_t buffer[BKDISPLAY_IO_BYTES];
  uint32_t remaining = size;
  uint32_t state = 0xffffffffu;
  int ret;

  ret = bkdisplay_seek(fd, offset);
  if (ret < 0)
    {
      return ret;
    }

  while (remaining > 0)
    {
      size_t chunk = remaining < sizeof(buffer) ? remaining : sizeof(buffer);

      ret = bkdisplay_read_exact(fd, buffer, chunk);
      if (ret < 0)
        {
          return ret;
        }

      state = bkdisplay_crc32_update(state, buffer, chunk);
      remaining -= (uint32_t)chunk;
    }

  *result = state ^ 0xffffffffu;
  return 0;
}

static int bkdisplay_zero_region(int fd, uint32_t offset, uint32_t size)
{
  uint8_t buffer[64];
  uint32_t remaining = size;
  int ret;

  ret = bkdisplay_seek(fd, offset);
  if (ret < 0)
    {
      return ret;
    }

