open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_display_pack.c
  while (remaining > 0)
    {
      size_t chunk = remaining < sizeof(buffer) ? remaining : sizeof(buffer);
      size_t index;

      ret = bkdisplay_read_exact(fd, buffer, chunk);
      if (ret < 0)
        {
          return ret;
        }

      for (index = 0; index < chunk; index++)
        {
          if (buffer[index] != 0)
            {
              return -EPROTO;
            }
        }

      remaining -= (uint32_t)chunk;
    }

  return 0;
}

static int bkdisplay_decode(struct bkdisplay_pack_s *pack,
                            const struct bkdisplay_entry_s *entry,
                            bool mirror, uint16_t *pixels)
{
  uint8_t buffer[BKDISPLAY_IO_BYTES];
  uint32_t decoded = 0;
  uint32_t remaining = entry->stored_size;
  uint32_t state = 0xffffffffu;
  int ret;

  ret = bkdisplay_seek(pack->fd, entry->offset);
  if (ret < 0)
    {
      return ret;
    }

  while (remaining > 0)
    {
      size_t chunk = remaining < sizeof(buffer) ? remaining : sizeof(buffer);
      size_t index;

      ret = bkdisplay_read_exact(pack->fd, buffer, chunk);
      if (ret < 0)
        {
          return ret;
        }

      if (entry->codec == BKDISPLAY_CODEC_RAW)
        {
          state = bkdisplay_crc32_update(state, buffer, chunk);
          for (index = 0; index < chunk; index++)
            {
              uint8_t palette_index = buffer[index];

              if (palette_index >= pack->info.palette_count ||
                  decoded >= entry->decoded_size)
                {
                  return -EPROTO;
                }

              if (pixels != NULL)
                {
                  uint32_t target = decoded;

                  if (mirror)
                    {
                      uint32_t row = decoded / entry->width;
                      uint32_t column = decoded % entry->width;

                      target = row * entry->width + entry->width - 1u - column;
                    }

                  pixels[target] = pack->palette[palette_index];
                }

              decoded++;
            }
        }
      else
        {
          if ((chunk & 1u) != 0)
            {
              return -EPROTO;
            }

          for (index = 0; index < chunk; index += 2)
            {
              uint8_t count = buffer[index];
              uint8_t palette_index = buffer[index + 1];
              unsigned int run;

              if (count == 0 || palette_index >= pack->info.palette_count ||
                  decoded + count > entry->decoded_size)
                {
                  return -EPROTO;
                }

              for (run = 0; run < count; run++)
                {
                  uint32_t target = decoded;

                  state = bkdisplay_crc32_update(state, &palette_index, 1);
                  if (pixels != NULL)
                    {
                      if (mirror)
                        {
                          uint32_t row = decoded / entry->width;
                          uint32_t column = decoded % entry->width;

                          target = row * entry->width + entry->width - 1u -
                                   column;
                        }

                      pixels[target] = pack->palette[palette_index];
                    }

                  decoded++;
                }
            }
        }

      remaining -= (uint32_t)chunk;
    }

  if (decoded != entry->decoded_size ||
      (state ^ 0xffffffffu) != entry->crc32)
    {
      return -EBADMSG;
    }

  return 0;
}

static int bkdisplay_frame_identity(const struct bkdisplay_entry_s *entry,
                                    char *id, uint8_t *side)
{
  static const char prefix[] = "expression/";
  const char *suffix;
  const char *end;
  size_t length;

  if (strncmp(entry->name, prefix, sizeof(prefix) - 1u) != 0)
    {
      return -EPROTO;
    }

  suffix = entry->name + sizeof(prefix) - 1u;
  end = strchr(suffix, '/');
  length = end == NULL ? strlen(suffix) : (size_t)(end - suffix);
  if (length == 0 || length >= BKDISPLAY_EXPRESSION_SIZE)
    {
      return -EPROTO;
    }

  memcpy(id, suffix, length);
  id[length] = '\0';
  if (!bkdisplay_expression_id(id))
    {
      return -EPROTO;
    }

  if (entry->side == BKDISPLAY_SIDE_UNMAPPED)
    {
      if (end != NULL)
        {
          return -EPROTO;
        }
    }
  else
    {
      const char *expected = entry->side == BKDISPLAY_SIDE_LEFT ?
                             "left" : "right";

      if (end == NULL || strcmp(end + 1, expected) != 0 ||
          strchr(end + 1, '/') != NULL)
        {
          return -EPROTO;
        }
    }

  *side = entry->side;
  return 0;
}

static int bkdisplay_parse_entry(const uint8_t *raw,
                                 struct bkdisplay_entry_s *entry)
{
  int ret;

  memset(entry, 0, sizeof(*entry));
  ret = bkdisplay_padded_ascii(raw, 32, entry->name, sizeof(entry->name),
                               false);
  if (ret < 0)
    {
      return ret;
    }

  entry->kind = raw[32];
  entry->codec = raw[33];
  entry->pixel_format = raw[34];
  entry->side = raw[35];
  entry->flags = bkdisplay_le16(raw + 36);
  entry->width = bkdisplay_le16(raw + 38);
  entry->height = bkdisplay_le16(raw + 40);
  entry->palette_count = bkdisplay_le16(raw + 42);
  entry->offset = bkdisplay_le32(raw + 44);
  entry->stored_size = bkdisplay_le32(raw + 48);
  entry->decoded_size = bkdisplay_le32(raw + 52);
  entry->crc32 = bkdisplay_le32(raw + 56);

  if (bkdisplay_le32(raw + 60) != 0 || entry->stored_size == 0 ||
      entry->decoded_size == 0 || entry->side > BKDISPLAY_SIDE_RIGHT ||
      (entry->flags & ~BKDISPLAY_ENTRY_MIRROR_RIGHT) != 0 ||
      (entry->flags != 0 && entry->side != BKDISPLAY_SIDE_UNMAPPED))
    {
      return -EPROTO;
    }

  return 0;
}

static int bkdisplay_validate_entries(struct bkdisplay_pack_s *pack,
                                      const uint8_t *toc,
                                      uint32_t payload_offset)
{
  struct bkdisplay_expression_s expressions[BKDISPLAY_MAX_ENTRIES - 1u];
  char last_frame[32] = "";
  uint32_t cursor = payload_offset;
  unsigned int expression_count = 0;
  bool neutral = false;
  unsigned int index;
  int ret;

  memset(expressions, 0, sizeof(expressions));
  for (index = 0; index < pack->info.entry_count; index++)
    {
      struct bkdisplay_entry_s *entry = &pack->entries[index];
      uint32_t aligned;
      unsigned int previous;

