open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_display_pack.c
      ret = bkdisplay_parse_entry(toc + index * BKDISPLAY_ENTRY_SIZE, entry);
      if (ret < 0)
        {
          return ret;
        }

      for (previous = 0; previous < index; previous++)
        {
          if (strcmp(pack->entries[previous].name, entry->name) == 0)
            {
              return -EEXIST;
            }
        }

      aligned = bkdisplay_align4(cursor);
      if (entry->offset != aligned ||
          (uint64_t)entry->offset + entry->stored_size >
          pack->info.total_size)
        {
          return -EPROTO;
        }

      ret = bkdisplay_zero_region(pack->fd, cursor, aligned - cursor);
      if (ret < 0)
        {
          return ret;
        }

      if (index == 0)
        {
          uint8_t palette[512];
          unsigned int color;

          if (strcmp(entry->name, "palette/default") != 0 ||
              entry->kind != BKDISPLAY_KIND_PALETTE ||
              entry->codec != BKDISPLAY_CODEC_RAW ||
              entry->pixel_format != BKDISPLAY_PIXEL_RGB565LE ||
              entry->side != BKDISPLAY_SIDE_UNMAPPED || entry->flags != 0 ||
              entry->width != 0 || entry->height != 0 ||
              entry->palette_count < 2 || entry->palette_count > 256 ||
              entry->stored_size != entry->decoded_size ||
              entry->decoded_size != (uint32_t)entry->palette_count * 2u)
            {
              return -EPROTO;
            }

          ret = bkdisplay_seek(pack->fd, entry->offset);
          if (ret < 0)
            {
              return ret;
            }

          ret = bkdisplay_read_exact(pack->fd, palette,
                                     entry->decoded_size);
          if (ret < 0)
            {
              return ret;
            }

          if ((bkdisplay_crc32_update(0xffffffffu, palette,
                                      entry->decoded_size) ^ 0xffffffffu) !=
              entry->crc32)
            {
              return -EBADMSG;
            }

          pack->info.palette_count = entry->palette_count;
          for (color = 0; color < entry->palette_count; color++)
            {
              pack->palette[color] = bkdisplay_le16(palette + color * 2u);
            }
        }
      else
        {
          char expression[BKDISPLAY_EXPRESSION_SIZE];
          uint8_t side;
          unsigned int found;

          if (entry->kind != BKDISPLAY_KIND_INDEXED_FRAME ||
              (entry->codec != BKDISPLAY_CODEC_RAW &&
               entry->codec != BKDISPLAY_CODEC_RLE8) ||
              entry->pixel_format != BKDISPLAY_PIXEL_INDEX8 ||
              entry->width != pack->info.width ||
              entry->height != pack->info.height ||
              entry->palette_count != 0 ||
              entry->decoded_size != BKDISPLAY_CANVAS_PIXELS ||
              (entry->codec == BKDISPLAY_CODEC_RAW &&
               entry->stored_size != entry->decoded_size) ||
              (entry->codec == BKDISPLAY_CODEC_RLE8 &&
               ((entry->stored_size & 1u) != 0 ||
                entry->stored_size > entry->decoded_size * 2u)) ||
              strcmp(entry->name, last_frame) <= 0)
            {
              return -EPROTO;
            }

          ret = bkdisplay_frame_identity(entry, expression, &side);
          if (ret < 0)
            {
              return ret;
            }

          snprintf(last_frame, sizeof(last_frame), "%s", entry->name);
          neutral = neutral || strcmp(expression, "neutral") == 0;
          for (found = 0; found < expression_count; found++)
            {
              if (strcmp(expressions[found].id, expression) == 0)
                {
                  break;
                }
            }

          if (found == expression_count)
            {
              if (expression_count >= BKDISPLAY_MAX_ENTRIES - 1u)
                {
                  return -E2BIG;
                }

              snprintf(expressions[found].id, sizeof(expressions[found].id),
                       "%s", expression);
              expression_count++;
            }

          if ((expressions[found].sides & (1u << side)) != 0)
            {
              return -EEXIST;
            }

          expressions[found].sides |= (uint8_t)(1u << side);
          ret = bkdisplay_decode(pack, entry, false, NULL);
          if (ret < 0)
            {
              return ret;
            }
        }

      cursor = entry->offset + entry->stored_size;
    }

  if (cursor != pack->info.total_size || !neutral)
    {
      return -EPROTO;
    }

  for (index = 0; index < expression_count; index++)
    {
      uint8_t shared = (uint8_t)(1u << BKDISPLAY_SIDE_UNMAPPED);
      uint8_t pair = (uint8_t)((1u << BKDISPLAY_SIDE_LEFT) |
                               (1u << BKDISPLAY_SIDE_RIGHT));

      if (expressions[index].sides != shared &&
          expressions[index].sides != pair)
        {
          return -EPROTO;
        }
    }

  return 0;
}

int bkdisplay_pack_open(const char *path, struct bkdisplay_pack_s **result,
                        struct bkdisplay_pack_info_s *info)
{
  static const uint8_t magic[8] = {'S', 'H', 'N', 'E', 'Y', 'E', '1', 0};
  struct bkdisplay_pack_s *pack = NULL;
  struct stat statbuf;
  uint8_t header[BKDISPLAY_HEADER_SIZE];
  uint8_t *toc = NULL;
  uint32_t toc_size;
  uint32_t payload_offset;
  uint32_t crc;
  unsigned int index;
  int fd = -1;
  int ret;

  if (path == NULL || *path == '\0' || result == NULL)
    {
      return -EINVAL;
    }

  *result = NULL;
  fd = open(path, O_RDONLY);
  if (fd < 0)
    {
      ret = bkdisplay_errno();
      if (ret != -ENOENT)
        {
          BKDISPLAY_PACK_DIAG(
            "BKDISPLAY PACK stage=open path=%s ret=%d\n", path, ret);
        }

      return ret;
    }

  if (fstat(fd, &statbuf) < 0)
    {
      ret = bkdisplay_errno();
      BKDISPLAY_PACK_DIAG(
        "BKDISPLAY PACK stage=fstat path=%s ret=%d\n", path, ret);
      goto out;
    }

  if (!S_ISREG(statbuf.st_mode) || statbuf.st_size < BKDISPLAY_HEADER_SIZE ||
      statbuf.st_size > BKDISPLAY_MAX_PACK_BYTES)
    {
      BKDISPLAY_PACK_DIAG(
        "BKDISPLAY PACK stage=stat-check path=%s mode=%lo size=%lld ret=%d\n",
        path, (unsigned long)statbuf.st_mode,
        (long long)statbuf.st_size, -EINVAL);
      ret = -EINVAL;
      goto out;
    }

  ret = bkdisplay_read_exact(fd, header, sizeof(header));
  if (ret < 0)
    {
      goto out;
    }

  pack = calloc(1, sizeof(*pack));
  if (pack == NULL)
    {
      ret = -ENOMEM;
      goto out;
    }

  pack->fd = fd;
  if (memcmp(header, magic, sizeof(magic)) != 0 ||
      bkdisplay_le16(header + 8) != BKDISPLAY_PACK_VERSION ||
      bkdisplay_le16(header + 10) != BKDISPLAY_HEADER_SIZE ||
      bkdisplay_le16(header + 12) != BKDISPLAY_ENTRY_SIZE)
    {
      ret = -EPROTONOSUPPORT;
      goto out;
    }

  pack->info.entry_count = bkdisplay_le16(header + 14);
  pack->info.width = bkdisplay_le16(header + 16);
  pack->info.height = bkdisplay_le16(header + 18);
  pack->info.renderer_api = bkdisplay_le16(header + 20);
  pack->info.revision = bkdisplay_le32(header + 24);
  pack->info.total_size = bkdisplay_le32(header + 36);
  memcpy(pack->info.source_sha256, header + 80,
         sizeof(pack->info.source_sha256));

  if (pack->info.entry_count < 2 ||
      pack->info.entry_count > BKDISPLAY_MAX_ENTRIES ||
      pack->info.width != BKDISPLAY_CANVAS_WIDTH ||
      pack->info.height != BKDISPLAY_CANVAS_HEIGHT ||
      pack->info.renderer_api != BKDISPLAY_RENDERER_API ||
      bkdisplay_le16(header + 22) != 0 || pack->info.revision == 0 ||
      bkdisplay_le32(header + 28) != BKDISPLAY_HEADER_SIZE ||
      pack->info.total_size != (uint32_t)statbuf.st_size)
    {
      ret = -EPROTO;
      goto out;
    }

  for (index = 0; index < 16; index++)
    {
      if (header[112 + index] != 0)
        {
          ret = -EPROTO;
          goto out;
        }
    }

  for (index = 0; index < sizeof(pack->info.source_sha256); index++)
    {
      if (pack->info.source_sha256[index] != 0)
        {
          break;
        }
    }

