open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_display_pack.c
  if (index == sizeof(pack->info.source_sha256))
    {
      ret = -EPROTO;
      goto out;
    }

  ret = bkdisplay_padded_ascii(header + 48, 32, pack->info.pack_id,
                               sizeof(pack->info.pack_id), true);
  if (ret < 0)
    {
      goto out;
    }

  toc_size = (uint32_t)pack->info.entry_count * BKDISPLAY_ENTRY_SIZE;
  payload_offset = bkdisplay_align4(BKDISPLAY_HEADER_SIZE + toc_size);
  if (bkdisplay_le32(header + 32) != payload_offset ||
      payload_offset >= pack->info.total_size)
    {
      ret = -EPROTO;
      goto out;
    }

  toc = malloc(toc_size);
  if (toc == NULL)
    {
      ret = -ENOMEM;
      goto out;
    }

  ret = bkdisplay_seek(fd, BKDISPLAY_HEADER_SIZE);
  if (ret < 0 || (ret = bkdisplay_read_exact(fd, toc, toc_size)) < 0)
    {
      goto out;
    }

  crc = bkdisplay_crc32_update(0xffffffffu, toc, toc_size) ^ 0xffffffffu;
  if (crc != bkdisplay_le32(header + 40))
    {
      ret = -EBADMSG;
      goto out;
    }

  ret = bkdisplay_zero_region(fd, BKDISPLAY_HEADER_SIZE + toc_size,
                              payload_offset -
                              (BKDISPLAY_HEADER_SIZE + toc_size));
  if (ret < 0)
    {
      goto out;
    }

  ret = bkdisplay_crc_region(fd, payload_offset,
                             pack->info.total_size - payload_offset, &crc);
  if (ret < 0 || crc != bkdisplay_le32(header + 44))
    {
      ret = ret < 0 ? ret : -EBADMSG;
      goto out;
    }

  ret = bkdisplay_validate_entries(pack, toc, payload_offset);
  if (ret < 0)
    {
      goto out;
    }

  if (info != NULL)
    {
      *info = pack->info;
    }

  free(toc);
  *result = pack;
  return 0;

out:
  free(toc);
  free(pack);
  close(fd);
  return ret;
}

void bkdisplay_pack_close(struct bkdisplay_pack_s *pack)
{
  if (pack != NULL)
    {
      if (pack->fd >= 0)
        {
          close(pack->fd);
        }

      free(pack);
    }
}

int bkdisplay_pack_render(struct bkdisplay_pack_s *pack,
                          const char *expression,
                          enum bkdisplay_side_e side,
                          uint16_t *pixels, size_t pixel_count)
{
  char shared_name[32];
  char side_name[32];
  const struct bkdisplay_entry_s *shared = NULL;
  const struct bkdisplay_entry_s *specific = NULL;
  const struct bkdisplay_entry_s *selected;
  unsigned int index;
  bool mirror;

  if (pack == NULL || !bkdisplay_expression_id(expression) ||
      side > BKDISPLAY_SIDE_RIGHT || pixels == NULL ||
      pixel_count < BKDISPLAY_CANVAS_PIXELS)
    {
      return -EINVAL;
    }

  if (snprintf(shared_name, sizeof(shared_name), "expression/%s",
               expression) >= (int)sizeof(shared_name))
    {
      return -ENAMETOOLONG;
    }

  side_name[0] = '\0';
  if (side != BKDISPLAY_SIDE_UNMAPPED &&
      snprintf(side_name, sizeof(side_name), "expression/%s/%s",
               expression, side == BKDISPLAY_SIDE_LEFT ? "left" : "right") >=
      (int)sizeof(side_name))
    {
      return -ENAMETOOLONG;
    }

  for (index = 1; index < pack->info.entry_count; index++)
    {
      if (strcmp(pack->entries[index].name, shared_name) == 0)
        {
          shared = &pack->entries[index];
        }

      if (side_name[0] != '\0' &&
          strcmp(pack->entries[index].name, side_name) == 0)
        {
          specific = &pack->entries[index];
        }
    }

  if (side == BKDISPLAY_SIDE_UNMAPPED)
    {
      selected = shared;
    }
  else
    {
      selected = specific != NULL ? specific : shared;
    }

  if (selected == NULL)
    {
      return side == BKDISPLAY_SIDE_UNMAPPED ? -EADDRNOTAVAIL : -ENOENT;
    }

  mirror = side == BKDISPLAY_SIDE_RIGHT && selected == shared &&
           (selected->flags & BKDISPLAY_ENTRY_MIRROR_RIGHT) != 0;
  return bkdisplay_decode(pack, selected, mirror, pixels);
}
